[Skills.BurnBabyBurn:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Burn Damage: $NUMBER$"

[Skills.BurnBabyBurn:AttributePresentationDefinition_1 AttributePresentationDefinition]
Description="Self-Ignite Chance: $NUMBER$"

[Skills.BurnBabyBurn:AttributePresentationDefinition_2 AttributePresentationDefinition]
Description="Additional On Fire Bonus: $NUMBER$"

[Skills.DelusionalDamage SkillDefinition]
SkillDescription="All [skill]Elemental Status Effects[-skill] you inflict have a chance to [incendiary]light yourself on fire[-incendiary].<br><br>Ignite chances are determined by those accumulated from [skill]Burn, Baby, Burn[-skill] and [skill]Fuel the Fire[-skill]."

[Skills.ElementalElation SkillDefinition]
SkillDescription="While [skill]Elemental Status Effect Damage[-skill] is being done to enemies, you gain stacks of [skill]Elemental Elation[-skill].  [skill]Fire Rate[-skill] and [skill]Magazine Size[-skill] increased for each stack of [skill]Elemental Elation[-skill].<br><br>Stacks will not decay [incendiary]while you are on fire[-incendiary]."

[Skills.ElementalElation:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Fire Rate: $NUMBER$ per stack"

[Skills.ElementalElation:AttributePresentationDefinition_1 AttributePresentationDefinition]
Description="Magazine Size: $NUMBER$ per stack"

[Skills.ElementalElation:AttributePresentationDefinition_2 AttributePresentationDefinition]
Description="Max Stacks: $NUMBER$"

[Skills.FireFiend SkillDefinition]
SkillDescription="[skill]Melee attacks[-skill] have a chance to [incendiary]Ignite[-incendiary] enemies.<br><br>[skill]Weapon Accuracy[-skill] and [skill]Reload Speed[-skill] are increased [incendiary]while you are on fire[-incendiary]."

[Skills.FlameFlare SkillDefinition]
SkillDescription="Increases the duration of all [incendiary]Burn Effects[-incendiary] on you.  Each time you apply a [incendiary]Burn Effect[-incendiary] to an enemy, there's a chance another [incendiary]Burn Effect[-incendiary] will be applied after a short time."

[Skills.FlameFlare:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Burn Duration: $NUMBER$"

[Skills.FlameFlare:AttributePresentationDefinition_1 AttributePresentationDefinition]
Description="Reignite Chance: $NUMBER$"

[Skills.FuelTheFire:AttributePresentationDefinition_1 AttributePresentationDefinition]
Description="Self-Ignite Chance: $NUMBER$"

[Skills.HellfireHalitosis:AttributePresentationDefinition_1 AttributePresentationDefinition]
Description="Cooldown: $NUMBER$ secs"

[Skills.PainIsPower SkillDefinition]
SkillDescription="Increases [skill]Gun Damage[-skill] for all gun types except sniper rifles, decreases [skill]Critical Hit Damage[-skill] with all weapons, and increases [skill]Melee Damage[-skill].<br><br>Effects further increased [incendiary]while you are on fire[-incendiary]."

[Skills.PainIsPower:AttributePresentationDefinition_1 AttributePresentationDefinition]
Description="Weapon/Melee Damage: $NUMBER$"

[Skills.RavingRetribution SkillDefinition]
SkillDescription="[incendiary]While you are on fire[-incendiary], taking damage from enemies will spawn [incendiary]homing balls of fire[-incendiary] that seek out the attacker and explode on impact.  Fireballs can only trigger once per second."
